index=sysmon EventCode=10 TargetImage="*lsass.exe" (GrantedAccess="0x0040" OR GrantedAccess="0x1FFFFF" OR GrantedAccess="0x1010" OR GrantedAccess="0x1410" OR GrantedAccess="0x1438" OR GrantedAccess="0x143a") NOT (Image="*csrss.exe" OR Image="*lsm.exe" OR Image="*wininit.exe" OR Image="*services.exe" OR Image="*svchost.exe" OR Image="*WmiPrvSE.exe" OR Image="*msiexec.exe" OR Image="*Windows Defender*") | table _time host user Image TargetImage GrantedAccess
